Tekla.Structures.Drawing.CannotCreateSectionViewFrom3dView
The CannotCreateSectionViewFrom3dView class defines the exception that is
thrown when a user tries to create a section view from a 3d view.

Tekla.Structures.Drawing.CannotCreateSectionViewFrom3dView.#ctor(System.String)
Creates a new cannot create section view from 3d view exception instance.
Message: The exception message.

Tekla.Structures.Drawing.CannotCreateSectionViewFrom3dView.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.